cf_billing/InformationRegisters/энргКоличествоПрописанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПрописанных</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПроживаниеЖильцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПроживаниеЖильцов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеЖильцов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСобственности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСобственностиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСобственностиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПроживающих</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоСобственников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоЖильцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоЖильцов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоКомнат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияДополнительныхСоциальныхНормативов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияДополнительныхСоциальныхНормативов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидБлагоустройствМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидБлагоустройствМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСПараметрамиРасчетаАбонентаСервер/Ext/Module.bsl
#Область ОбработчикиСобытий

Процедура УстановитьКоличествоПрописанных(ДанныеШапки,Движения)  Экспорт 
	Если ДанныеШапки.свойство("КоличествоПрописанных") тогда
		Набор  							= Движения.энргКоличествоПрописанных;
	//	Если ЗначениеЗаполнено(ДанныеШапки.КоличествоПрописанных) тогда
			Запись  					= Набор.добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.Район;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
			Запись.Количество 			= ДанныеШапки.КоличествоПрописанных;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;   
	//	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьИзменениеПрописанныхЖильцов(ДанныеШапки,Движения)  Экспорт 
	Набор  							= Движения.энргПроживаниеЖильцов;
	
	Запрос 							= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("Район", 			ДанныеШапки.Район);
	Запрос.УстановитьПараметр("КлючПомещения", 	ДанныеШапки.КлючПомещения);
	Запрос.УстановитьПараметр("Ссылка",ДанныеШапки.Ссылка);
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	энргУстановитьКоличествоПрописанныхЖильцы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	энргУстановитьКоличествоПрописанныхЖильцы.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
	|	энргУстановитьКоличествоПрописанныхЖильцы.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
	|	энргУстановитьКоличествоПрописанныхЖильцы.Состояние КАК Состояние
	|ИЗ
	|	Документ.энргУстановитьКоличествоПрописанных.Жильцы КАК энргУстановитьКоличествоПрописанныхЖильцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
	|				,
	|				Организация = &Организация
	|					И Район = &Район
	|					И КлючПомещения = &КлючПомещения) КАК энргПроживаниеЖильцовСрезПоследних
	|		ПО энргУстановитьКоличествоПрописанныхЖильцы.ФизическоеЛицо = энргПроживаниеЖильцовСрезПоследних.Жилец
	|			И энргУстановитьКоличествоПрописанныхЖильцы.Состояние <> энргПроживаниеЖильцовСрезПоследних.Состояние
	|ГДЕ
	|	энргУстановитьКоличествоПрописанныхЖильцы.Ссылка = &Ссылка";	
	
	РезультатЗапроса 				= Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи 			= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.Район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
		Запись.Жилец 				= ВыборкаДетальныеЗаписи.ФизическоеЛицо;
		Запись.Состояние 			= ВыборкаДетальныеЗаписи.Состояние;	
		Запись.ДоляСобственностиЧислитель 	= ВыборкаДетальныеЗаписи.ДоляСобственностиЧислитель;
		Запись.ДоляСобственностиЗнаменатель = ВыборкаДетальныеЗаписи.ДоляСобственностиЗнаменатель;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьКоличествоПроживающих(ДанныеШапки,Движения)  Экспорт 
	Если ДанныеШапки.свойство("КоличествоПроживающих") тогда
		Набор  							= Движения.энргКоличествоПроживающих;
		//Если ЗначениеЗаполнено(ДанныеШапки.КоличествоПроживающих) тогда
			Запись  					= Набор.добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.Район;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
			Запись.Количество 			= ДанныеШапки.КоличествоПроживающих;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;   
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьКоличествоСобственников(ДанныеШапки,Движения)  Экспорт 
	Если ДанныеШапки.свойство("КоличествоСобственников") тогда
		Набор  						= Движения.энргКоличествоСобственников;	
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.Район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
		Запись.Количество			= ДанныеШапки.КоличествоСобственников;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;   
	КонецЕсли;
КонецПроцедуры 

Процедура УстановитьКоличествоЖильцов(ДанныеШапки,КлючПомещенияРодителя,Движения)  Экспорт 

	Если ДанныеШапки.свойство("КоличествоЖильцов") тогда
		
		КоличествоЖильцов = ПолучитьКоличествоЖильцов(ДанныеШапки);
		
		Набор  							= Движения.энргКоличествоЖильцов;
		//Если ЗначениеЗаполнено(ДанныеШапки.КоличествоЖильцов) тогда
			Запись  					= Набор.добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.Район;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.КлючПомещения		= КлючПомещенияРодителя;
			Запись.Количество 			= ДанныеШапки.КоличествоЖильцов + КоличествоЖильцов;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;   
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьКоличествоПрописанныхРезультатЗапроса(Результат,Движения)  Экспорт 
	Набор  							= Движения.энргКоличествоПрописанных; 	
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= Выборка.Период;
		Запись.Район  				= Выборка.Район;
		Запись.КлючПомещения		= Выборка.КлючПомещения;
		Запись.Количество 			= Выборка.Количество;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;   
	КонецЦикла;
КонецПроцедуры

Процедура  УстановитьКоличествоКомнат(ДанныеШапки,Движения)  Экспорт 
	Если ДанныеШапки.свойство("КоличествоКомнат") тогда
		Набор  							= Движения.энргКоличествоКомнат;
		//Если ЗначениеЗаполнено(ДанныеШапки.КоличествоКомнат) тогда
			Запись  					= Набор.добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.Район;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
			Запись.Количество 			= ДанныеШапки.КоличествоКомнат;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура  УстановитьДополнительныеСоцНормативы(ДанныеШапки,Движения,ИмяКоллекции)  Экспорт 
	Если ДанныеШапки.Свойство(ИмяКоллекции) Тогда 
		Набор  								= Движения.энргЗначенияДополнительныхСоциальныхНормативов;
		Для Каждого Стр из ДанныеШапки[ИмяКоллекции] Цикл  
			Запись  							= Набор.добавить();
			Запись.Период  						= ДанныеШапки.Дата;
			Запись.ПериодРегистрации			= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления				= ДанныеШапки.ПериодНачисления;
			Запись.Организация  				= ДанныеШапки.Организация;
			Запись.Район  						= ДанныеШапки.Район;  
			Запись.Строение						= ДанныеШапки.Строение;
			Запись.Помещение					= ДанныеШапки.Помещение;
			Запись.ЧастныйСектор				= ДанныеШапки.ЧастныйСектор;
			Запись.Услуга						= Стр.Услуга;
			Запись.НаправлениеИспользованияТУ	= Стр.НаправлениеИспользованияТУ;
			Запись.ЗначениеНорматива			= Стр.ЗначениеНорматива;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура  УстановитьКоличествоКомнатРезультатЗапроса(Результат,Движения)  Экспорт 
	Набор  							= Движения.энргКоличествоКомнат; 	
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл 		
		Запись  					= Набор.добавить();
		Запись.Период  				= Выборка.Период;
		Запись.Район  				= Выборка.Район;
		Запись.КлючПомещения		= Выборка.КлючПомещения;
		Запись.Количество 			= Выборка.Количество;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	КонецЦикла;	
КонецПроцедуры

Процедура  УстановитьЗначениеПлощади(ДанныеШапки,Движения,ИмяКоллекции)  Экспорт 
	
	Набор  								= Движения.энргЗначенияПлощадей;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  						= Набор.добавить();
		Запись.Период  					= ДанныеШапки.Дата;
		Запись.Район  					= ДанныеШапки.Район;
		Запись.Организация  			= ДанныеШапки.Организация;
		Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
		Запись.ВидПлощади 				= стр.ВидПлощади;
		Запись.Площадь 					= стр.Значение;
		Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьЖильцов(ДанныеШапки,Движения) Экспорт 
	
	Набор  							= Движения.энргПроживаниеЖильцов;
	
	для Каждого стр из ДанныеШапки.Жильцы цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.Район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
		Запись.Жилец 				= стр.ФизическоеЛицо;
		Запись.Состояние 			= Перечисления.энргСостояниеЖильцов.Регистрация;
		//Запись.ДоляСобственности 	= стр.ДоляСобственности;	
		Запись.ДоляСобственностиЧислитель 	= стр.ДоляСобственностиЧислитель;
		Запись.ДоляСобственностиЗнаменатель = стр.ДоляСобственностиЗнаменатель;
	КонецЦикла;  
	
КонецПроцедуры

Процедура УстановитьОснованияСобственностиЖильцов(ДанныеШапки,Движения) Экспорт 
	
	//Набор  							= Движения.энргПроживаниеЖильцов;
	//для Каждого стр из ДанныеШапки.Жильцы цикл
	//	Запись  					= Набор.добавить();
	//	Запись.Период  				= ДанныеШапки.Дата;
	//	Запись.Район  				= ДанныеШапки.Район;
	//	Запись.Организация  		= ДанныеШапки.Организация;
	//	Запись.Абонент 				= ДанныеШапки.Абонент;
	//	Запись.Жилец 				= стр.ФизическоеЛицо;
	//	Запись.Состояние 			= Перечисления.энргСостояниеЖильцов.Регистрация;
	//	//Запись.ДоляСобственности 	= стр.ДоляСобственности;	
	//	Запись.ДоляСобственностиЧислитель 	= стр.ДоляСобственностиЧислитель;
	//	Запись.ДоляСобственностиЗнаменатель = стр.ДоляСобственностиЗнаменатель;
	//КонецЦикла;  
	
КонецПроцедуры

Процедура ЗаполнитьВидБлагоустроства(ДанныеШапки,Движения) Экспорт
	
	Если ДанныеШапки.Свойство("ВидыБлагоустройстваТарифныеКатегории") Тогда
		Набор = Движения.энргВидБлагоустройствАбонента;
		Для Каждого СтрокаВида Из ДанныеШапки.ВидыБлагоустройстваТарифныеКатегории Цикл
			Запись  						= Набор.добавить();
			Запись.Период  					= ДанныеШапки.Дата;
			Запись.Район 					= ДанныеШапки.Район;
			Запись.Организация  			= ДанныеШапки.Организация;
			Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
			Запись.ВидБлагоустройства 		= СтрокаВида.ВидБлагоустройстваИндивидуальный;
			Запись.Услуга			 		= СтрокаВида.Услуга;
			Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
		КонецЦикла;
	ИначеЕсли ДанныеШапки.Свойство("ВидыБлагоустройств") Тогда
		Набор = Движения.энргВидБлагоустройствАбонента;
		Для Каждого СтрокаВида Из ДанныеШапки.ВидыБлагоустройств Цикл
						
			Запись  						= Набор.добавить();
			Запись.Период  					= ДанныеШапки.Дата;
			Запись.Район 					= ДанныеШапки.Район;
			Запись.Организация  			= ДанныеШапки.Организация;
			Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
			запись.ВидБлагоустройства		= СтрокаВида.ВидБлагоустройства;
			запись.Услуга					= СтрокаВида.Услуга;
			Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
		КонецЦикла;
	Иначе
		Набор  							= Движения.энргВидБлагоустройствАбонента;
		Запись  						= Набор.добавить();
		Запись.Период  					= ДанныеШапки.Дата;
		Запись.Район 					= ДанныеШапки.Район;
		Запись.Организация  			= ДанныеШапки.Организация;
		Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
		Запись.ВидБлагоустройства 		= ДанныеШапки.ВидБлагоустройства;
		Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	КонецЕсли;
	

КонецПроцедуры

Процедура ЗаполнитьВидБлагоустростваРезультатЗапроса(Результат,Движения) Экспорт 
	
	Выборка  							= Результат.выбрать();
	Пока Выборка.следующий() цикл
		Набор  							= Движения.энргВидБлагоустройствАбонента;
		Запись  						= Набор.добавить();
		Запись.Период  					= Выборка.Период;
		Запись.Район 					= Выборка.Район;
		Запись.КлючПомещения			= Выборка.КлючПомещения;
		Запись.ВидБлагоустройства 		= Выборка.ВидБлагоустройства;
		Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления			= Выборка.ПериодНачисления;		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УстановитьЗначениеПлощадиМКД(Движения, ДанныеШапки,ИмяКоллекции) Экспорт
	Набор 							= Движения.энргЗначениеПлощадейМКД;
	Для каждого стр из ДанныеШапки[ИмяКоллекции] Цикл
		Запись 						= Набор.Добавить();
		Запись.Период 				= ДанныеШапки.Дата;
		Запись.Район				= ДанныеШапки.Район;
		Запись.Организация 			= ДанныеШапки.Организация;
		Запись.МКД 					= ДанныеШапки.МКД;
		Запись.ВидПлощади 			= стр.ВидПлощади;
		Запись.Услуга	 			= стр.Услуга;
		Запись.Площадь 				= стр.Площадь;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьВидБлагоУстройстваМКД(Движения, ДанныеШапки) Экспорт
		
	Если ДанныеШапки.Свойство("ВидыБлагоустройстваТарифныеКатегории") Тогда
		Для Каждого СтрокаВида Из ДанныеШапки.ВидыБлагоустройстваТарифныеКатегории Цикл
			
			Набор 						= Движения.энргВидБлагоустройствМКД;
			Запись						= Набор.Добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.Район;
			Запись.Организация 			= ДанныеШапки.Организация;
			Запись.МКД  				= ДанныеШапки.МКД;
			Запись.ВидБлагоустройства  	= СтрокаВида.ВидБлагоустройстваОбщедомовой;
			Запись.Услуга  				= СтрокаВида.Услуга;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления
			
		КонецЦикла; 
	Иначе
		Набор 						= Движения.энргВидБлагоустройствМКД;
		Запись						= Набор.Добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.Район;
		Запись.Организация 			= ДанныеШапки.Организация;
		Запись.МКД  				= ДанныеШапки.МКД;
		Запись.ВидБлагоустройства  	= ДанныеШапки.ВидБлагоустройства;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЭтажностьМКД(Движения, ДанныеШапки) Экспорт
	 
КонецПроцедуры

Процедура УстановитьФормуУправленияМКД(Движения, ДанныеШапки) Экспорт
	Набор 							= Движения.энргФормыУправленияМКД;
	Запись							= Набор.Добавить();
	Запись.Период  					= ДанныеШапки.Дата;
	Запись.Район  					= ДанныеШапки.Район;
	Запись.Организация 				= ДанныеШапки.Организация;
	Запись.МКД  					= ДанныеШапки.МКД;
	Запись.ФормаУправления  		= ДанныеШапки.ФормаУправления;
	Запись.УК						= ДанныеШапки.УК;
	Запись.РасчетОбъемовВыполняетУК	= ДанныеШапки.РасчетОбъемовВыполняетУК;
	Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
КонецПроцедуры

Процедура УстановитьФилиалМКД(Движения, ДанныеШапки) Экспорт
	Набор 						= Движения.энргФилиалыСтроений;
	Запись						= Набор.Добавить();
	Запись.Период  				= ДанныеШапки.Дата;
	Запись.Район  				= ДанныеШапки.Район;
	Запись.Организация 			= ДанныеШапки.Организация;
	Запись.Строение				= ДанныеШапки.МКД;
	Запись.Филиал			  	= ДанныеШапки.Филиал;
КонецПроцедуры

Процедура УстановитьГруппуПотребителей(Движения, ДанныеШапки) Экспорт 
		
	Если ДанныеШапки.Свойство("ВидыБлагоустройстваТарифныеКатегории") Тогда
		Для Каждого СтрокаВида Из ДанныеШапки.ВидыБлагоустройстваТарифныеКатегории Цикл
			Набор 							= Движения.энргГруппыПотребителейАбонентов;
			Запись							= Набор.Добавить();
			Запись.Период  					= ДанныеШапки.Дата;
			Запись.Район  					= ДанныеШапки.Район;
			Запись.Организация  			= ДанныеШапки.Организация;
			Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
			Запись.ГруппаПотребителей  		= СтрокаВида.ТарифнаяКатегория;
			Запись.Услуга  					= СтрокаВида.Услуга;
			Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
		КонецЦикла; 
	Иначе
		Набор 							= Движения.энргГруппыПотребителейАбонентов;
		Запись							= Набор.Добавить();
		Запись.Период  					= ДанныеШапки.Дата;
		Запись.Район  					= ДанныеШапки.Район;
		Запись.Организация  			= ДанныеШапки.Организация;
		Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
		Запись.ГруппаПотребителей  		= ДанныеШапки.ГруппаПотребителей;
		Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьГруппуПотребителейРезультатЗапроса(Результат, Движения) Экспорт 
	Набор 								= Движения.энргГруппыПотребителейАбонентов;
	Выборка  							= Результат.выбрать();
	Пока Выборка.следующий() цикл 		
		Запись							= Набор.Добавить();
		Запись.Период  					= Выборка.Период;
		Запись.Район  					= Выборка.Район;
		Запись.Абонент 					= Выборка.Абонент;
		Запись.ГруппаПотребителей  		= Выборка.ГруппаПотребителей;
		Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления			= Выборка.ПериодНачисления;	
	КонецЦикла;	  	
КонецПроцедуры
	
Процедура УстановитьТипСхемыГВС(Движения, ДанныеШапки) Экспорт
	Набор 							= Движения.энргТипСхемыГВС;
	Запись							= Набор.Добавить();
	Запись.Период  					= ДанныеШапки.Дата;
	Запись.Район  					= ДанныеШапки.Район;
	Запись.Организация  			= ДанныеШапки.Организация;
	Запись.МКД	 					= ДанныеШапки.МКД;
	Запись.ТипСхемы  				= ДанныеШапки.ТипСхемы;
	Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
КонецПроцедуры

Процедура УстановитьВидТепловогоПункта(Движения, ДанныеШапки) Экспорт
	Набор 							= Движения.энргТипПринадлежностиМКД;
	Запись							= Набор.Добавить();
	Запись.Период  					= ДанныеШапки.Дата;
	Запись.Район  					= ДанныеШапки.Район;
	Запись.Организация  			= ДанныеШапки.Организация;
	Запись.МКД	 					= ДанныеШапки.МКД;
	Запись.ВидТепловогоПункта  		= ДанныеШапки.ВидТепловогоПункта;
	Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
КонецПроцедуры

Процедура УстановитьЛьготнуюКатегорияЖильцам(ДанныеШапки, ТаблицаДанных, Движения) Экспорт
	Набор 							= Движения.энргЖильцыЛьготныхКатегорий;
	Для каждого стр из ТаблицаДанных цикл 
		Запись						= Набор.Добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.Район				= ДанныеШапки.Район;
		Запись.Абонент 				= ДанныеШапки.Абонент;
		Запись.Жилец				= стр.Жилец;
		Запись.ЛьготнаяКатегория	= стр.ЛьготнаяКатегория;
		Запись.ПроцентЛьготы		= стр.ПроцентЛьготы;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		Запись.Состояние		    = ДанныеШапки.ВидОперации = Перечисления.энргВидыОпераций.энргИзменениеЛьготыЖильцам_РегистрацияЛьготы;
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьЛьготностьЖильцовИзОткрытияЛС(ДанныеШапки,Движения) Экспорт
	Набор 								= Движения.бестЖильцыЛьготныхКатегорий;
	Запрос 								= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетомЖильцы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	энргОперацияСЛицевымСчетомЖильцы.бестЛьготнаяКатегория КАК бестЛьготнаяКатегория
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.Жильцы КАК энргОперацияСЛицевымСчетомЖильцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЖильцыЛьготныхКатегорий.СрезПоследних(&Период, ) КАК бестЖильцыЛьготныхКатегорийСрезПоследних
	|		ПО бестЖильцыЛьготныхКатегорийСрезПоследних.Район = энргОперацияСЛицевымСчетомЖильцы.Ссылка.Район
	|			И бестЖильцыЛьготныхКатегорийСрезПоследних.Организация = энргОперацияСЛицевымСчетомЖильцы.Ссылка.Организация
	|			И бестЖильцыЛьготныхКатегорийСрезПоследних.Жилец = энргОперацияСЛицевымСчетомЖильцы.ФизическоеЛицо
	|			И (бестЖильцыЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория = энргОперацияСЛицевымСчетомЖильцы.бестЛьготнаяКатегория
	|				ИЛИ НЕ бестЖильцыЛьготныхКатегорийСрезПоследних.Состояние)
	|ГДЕ
	|	энргОперацияСЛицевымСчетомЖильцы.Ссылка = &Ссылка
	|	И энргОперацияСЛицевымСчетомЖильцы.бестЛьготнаяКатегория <> ЗНАЧЕНИЕ(Справочник.бестЛьготныеКатегории.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(ДанныеШапки.Дата), ДанныеШапки.Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Ссылка", ДанныеШапки.Документ);
	
	РезультатЗапроса 				= Запрос.Выполнить();
	
	Выборка				 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись						= Набор.Добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.Район				= ДанныеШапки.Район;
		Запись.Абонент 				= ДанныеШапки.Абонент;
		Запись.Жилец				= Выборка.ФизическоеЛицо;
		Запись.ЛьготнаяКатегория	= Выборка.бестЛьготнаяКатегория;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		Запись.Состояние		    = Истина;	
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЛьготностьЖильцовЕИРЦРезультатЗапроса(Результат, Движения) Экспорт
	Набор 							= Движения.энргЖильцыЛьготныхКатегорий;
	
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл 		
 
		Запись						= Набор.Добавить();
		Запись.Период  				= Выборка.Период;
		Запись.Организация  		= Выборка.Организация;
		Запись.Район				= Выборка.Район;
		Запись.Абонент 				= Выборка.Абонент;
		Запись.Жилец				= Выборка.Жилец;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
		Запись.Состояние		    = Истина;
	КонецЦикла;	
КонецПроцедуры

Процедура ОтменитьЛьготностьЖильцовЕИРЦРезультатЗапроса(Результат, Движения) Экспорт
	
	Набор 							= Движения.энргЖильцыЛьготныхКатегорий;
	
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл 		
 
		Запись						= Набор.Добавить();
		Запись.Период  				= Выборка.Период;
		Запись.Организация  		= Выборка.Организация;
		Запись.Район				= Выборка.Район;
		Запись.Абонент 				= Выборка.Абонент;
		Запись.Жилец				= Выборка.Жилец;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
		Запись.Состояние		    = Ложь;
	КонецЦикла;	
КонецПроцедуры

Процедура  УстановитьТипСобственностиЖилья(ДанныеШапки,Движения)  Экспорт 
	Если ДанныеШапки.свойство("ТипСобственностиЖилья") тогда
		Набор  							= Движения.энргТипСобственностиАбонентов;
		Если ЗначениеЗаполнено(ДанныеШапки.ТипСобственностиЖилья) тогда
			Запись  					= Набор.добавить();
			ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.ТипСобственности		= ДанныеШапки.ТипСобственностиЖилья;
			Если Запись.ТипСобственности <> Перечисления.энргТипыСобственниковЖилья.МуниципальнаяСобственность
				И Запись.ТипСобственности <> Перечисления.энргТипыСобственниковЖилья.ФедеральнаяСобственность Тогда
				Запись.НомерДоговораСоцНайма = Неопределено;
				Запись.ДатаДоговораСоцНайма = Неопределено;
			КонецЕсли;
			//Запись.Организация 			= ДанныеШапки.Организация;
			//Запись.Район				= ДанныеШапки.Район;
			//Запись.КлючПомещения 		= ДанныеШапки.КлючПомещения;
			//Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			//Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьАбонентаПомещения(ДанныеШапки, Движения) Экспорт
	
	Набор 							= Движения["энргАбонентыПомещений"];
	Запись  						= Набор.добавить();
	Запись.Период  					= ДанныеШапки.Дата;
	Запись.Район 					= ДанныеШапки.Район;
	Запись.Организация  			= ДанныеШапки.Организация;
	Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
	Запись.Абонент			 		= ДанныеШапки.Абонент;
	Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	
КонецПроцедуры

Функция ПолучитьКоличествоЖильцов(ДанныеШапки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение,
		|	энргКлючиПомещений.Помещение.Родитель КАК Помещение,
		|	энргКлючиПомещений.Помещение КАК Квартира
		|ПОМЕСТИТЬ ТекПомещение
		|ИЗ
		|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.Ссылка = &ТекКлюч
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекПомещение.Помещение КАК Помещение,
		|	энргПомещения.Ссылка КАК Комната,
		|	ТекПомещение.Строение КАК Строение
		|ПОМЕСТИТЬ КомнатыПомещения
		|ИЗ
		|	ТекПомещение КАК ТекПомещение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
		|		ПО ТекПомещение.Помещение = энргПомещения.Родитель
		|			И ТекПомещение.Квартира <> энргПомещения.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомнатыПомещения.Помещение КАК Помещение,
		|	КомнатыПомещения.Комната КАК Комната,
		|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ КлючиКомнатПомещения
		|ИЗ
		|	КомнатыПомещения КАК КомнатыПомещения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО КомнатыПомещения.Комната = энргКлючиПомещений.Помещение
		|			И КомнатыПомещения.Строение = энргКлючиПомещений.Строение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоПрописанныхСрезПоследних.Организация КАК Организация,
		|	энргКоличествоПрописанныхСрезПоследних.Район КАК Район,
		|	энргКоличествоПрописанныхСрезПоследних.Количество КАК Количество,
		|	КлючиКомнатПомещения.Помещение КАК Помещение,
		|	энргКоличествоПрописанныхСрезПоследних.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ КоличествоПрописанных
		|ИЗ
		|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						КлючиКомнатПомещения.КлючПомещения
		|					ИЗ
		|						КлючиКомнатПомещения)) КАК энргКоличествоПрописанныхСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлючиКомнатПомещения КАК КлючиКомнатПомещения
		|		ПО энргКоличествоПрописанныхСрезПоследних.КлючПомещения = КлючиКомнатПомещения.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоПроживающихСрезПоследних.Организация КАК Организация,
		|	энргКоличествоПроживающихСрезПоследних.Район КАК Район,
		|	энргКоличествоПроживающихСрезПоследних.Количество КАК Количество,
		|	КлючиКомнатПомещения.Помещение КАК Помещение,
		|	энргКоличествоПроживающихСрезПоследних.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ КоличествоПроживающих
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						КлючиКомнатПомещения.КлючПомещения
		|					ИЗ
		|						КлючиКомнатПомещения)) КАК энргКоличествоПроживающихСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлючиКомнатПомещения КАК КлючиКомнатПомещения
		|		ПО энргКоличествоПроживающихСрезПоследних.КлючПомещения = КлючиКомнатПомещения.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоСобственниковСрезПоследних.Организация КАК Организация,
		|	энргКоличествоСобственниковСрезПоследних.Район КАК Район,
		|	энргКоличествоСобственниковСрезПоследних.Количество КАК Количество,
		|	КлючиКомнатПомещения.Помещение КАК Помещение,
		|	энргКоличествоСобственниковСрезПоследних.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ КоличествоСобственников
		|ИЗ
		|	РегистрСведений.энргКоличествоСобственников.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						КлючиКомнатПомещения.КлючПомещения
		|					ИЗ
		|						КлючиКомнатПомещения)) КАК энргКоличествоСобственниковСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлючиКомнатПомещения КАК КлючиКомнатПомещения
		|		ПО энргКоличествоСобственниковСрезПоследних.КлючПомещения = КлючиКомнатПомещения.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиКомнатПомещения.Помещение КАК Помещение,
		|	КлючиКомнатПомещения.Комната КАК Комната,
		|	ЕСТЬNULL(КоличествоПрописанных.Количество, ЕСТЬNULL(КоличествоПроживающих.Количество, ЕСТЬNULL(КоличествоСобственников.Количество, 0))) КАК КоличествоЖильцов
		|ПОМЕСТИТЬ КоличествоЖильцовПоКомнатам
		|ИЗ
		|	КлючиКомнатПомещения КАК КлючиКомнатПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоПрописанных КАК КоличествоПрописанных
		|		ПО КлючиКомнатПомещения.КлючПомещения = КоличествоПрописанных.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоПроживающих КАК КоличествоПроживающих
		|		ПО КлючиКомнатПомещения.КлючПомещения = КоличествоПроживающих.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСобственников КАК КоличествоСобственников
		|		ПО КлючиКомнатПомещения.КлючПомещения = КоличествоСобственников.КлючПомещения
		|
		|СГРУППИРОВАТЬ ПО
		|	КлючиКомнатПомещения.Помещение,
		|	КлючиКомнатПомещения.Комната,
		|	ЕСТЬNULL(КоличествоПрописанных.Количество, ЕСТЬNULL(КоличествоПроживающих.Количество, ЕСТЬNULL(КоличествоСобственников.Количество, 0)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоЖильцовПоКомнатам.Помещение КАК Помещение,
		|	СУММА(КоличествоЖильцовПоКомнатам.КоличествоЖильцов) КАК КоличествоЖильцов
		|ИЗ
		|	КоличествоЖильцовПоКомнатам КАК КоличествоЖильцовПоКомнатам
		|
		|СГРУППИРОВАТЬ ПО
		|	КоличествоЖильцовПоКомнатам.Помещение";
	
	Запрос.УстановитьПараметр("Организация", 		ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("Период", 			ДанныеШапки.Дата);
	Запрос.УстановитьПараметр("Район", 				ДанныеШапки.Район);
	Запрос.УстановитьПараметр("ТекКлюч", 			ДанныеШапки.КлючПомещения);

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоЖильцов;

КонецФункции

Процедура УстановитьДоговор(Абонент,Договор,Дата) Экспорт
	Запись = РегистрыСведений.энргДоговорыАбонентов.СоздатьМенеджерЗаписи();
	Запись.Абонент = Абонент;
	Запись.Договор = Договор;
	Запись.Период = Дата;
	Запись.Записать(Истина);
КонецПроцедуры

Процедура УстановитьТехническийСтатусТочекУчета(ДанныеШапки, Движения) Экспорт
	
	Если ДанныеШапки.Свойство("СтатусыТочекУчета") Тогда
		Набор = Движения.энргУслугиТочекУчета;
		Для Каждого СтрокаСтатуса Из ДанныеШапки.СтатусыТочекУчета Цикл
			
			//Если СтрокаСтатуса.ПредыдущееСостояние = СтрокаСтатуса.ТекущееСостояние Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Запись  						= Набор.добавить();
			Запись.Период  					= ДанныеШапки.Дата;
			Запись.Район 					= ДанныеШапки.Район;
			Запись.Организация  			= ДанныеШапки.Организация;
			Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
			Запись.ТочкаУчета 				= СтрокаСтатуса.ТочкаУчета;
			Запись.Услуга					= СтрокаСтатуса.Услуга;
			Запись.Техническая				= СтрокаСтатуса.ТекущееСостояние;
			Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьЖильцов(ДанныеШапки,Движения) Экспорт 
	
	Жилец = ДанныеШапки.Абонент.ФизЛицо;
	
	Если НЕ ЗначениеЗаполнено(Жилец) Тогда
		Возврат;
	КонецЕсли;
	
	Набор  							= Движения.энргПроживаниеЖильцов;
	
	Запись  					= Набор.добавить();
	Запись.Период  				= ДанныеШапки.Дата;
	Запись.Район  				= ДанныеШапки.Район;
	Запись.Организация  		= ДанныеШапки.Организация;
	Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
	Запись.Жилец 				= Жилец;
	Запись.Состояние 			= Перечисления.энргСостояниеЖильцов.Выписка;
	//Запись.ДоляСобственности 	= стр.ДоляСобственности;	
	//Запись.ДоляСобственностиЧислитель 	= стр.ДоляСобственностиЧислитель;
	//Запись.ДоляСобственностиЗнаменатель = стр.ДоляСобственностиЗнаменатель;
	
КонецПроцедуры

Процедура УстановитьТехническуюВозможностьУстановкиПУ(ДанныеШапки, Движения) Экспорт
	
	Если ДанныеШапки.Свойство("ТочкиУчета") Тогда
		Набор = Движения.энргТехническаяВозможностьУстановкиПУ;
		Для Каждого СтрокаСтатуса Из ДанныеШапки.ТочкиУчета Цикл 								
			Запись  						 = Набор.добавить();
			Запись.Период  					 = ДанныеШапки.Дата;
			Запись.Район 					 = ДанныеШапки.Район;
			Запись.Организация  			 = ДанныеШапки.Организация;
			Запись.КлючПомещения			 = ДанныеШапки.КлючПомещения;
			Запись.ТочкаУчета 				 = СтрокаСтатуса.ТочкаУчета;
			Запись.НетВозможностьУстановкиПУ = СтрокаСтатуса.НетВозможностьУстановкиПУ;
			Запись.ПериодРегистрации		 = ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления			 = ДанныеШапки.ПериодНачисления;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСпособДоставкиКвитанции(ДанныеШапки,Движения)  Экспорт 
	Если ДанныеШапки.свойство("СпособДоставки") тогда
		Набор  							= Движения.энргСпособыДоставкиКвитанции;
			Запись  					= Набор.добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.Район;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
			Запись.Абонент				= ДанныеШапки.Абонент;
			Запись.СпособДоставки 		= ДанныеШапки.СпособДоставки;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Функция КоличествоЧеловек(ДанныеАбонента) Экспорт 
	КоличествоЖильцов	 			= 0;
	КоличествоПроживающих 			= 0;
	КоличествоПрописанных 			= 0;
	КоличествоСобственников 		= 0;
	
	ЭтоСоотвествие 					= ТипЗнч(ДанныеАбонента) = Тип("Соответствие");
	
	Если ЭтоСоотвествие и НЕ ДанныеАбонента["КоличествоЖильцов"] = Неопределено Тогда
		 КоличествоЖильцов 		= ДанныеАбонента["КоличествоЖильцов"];
	ИначеЕсли НЕ ЭтоСоотвествие И ДанныеАбонента.Свойство("КоличествоЖильцов") И НЕ ДанныеАбонента.КоличествоЖильцов = Неопределено Тогда
		КоличествоЖильцов 		= ДанныеАбонента.КоличествоЖильцов;
	КонецЕсли;  
	
	Если ЭтоСоотвествие и НЕ ДанныеАбонента["КоличествоПроживающих"] = Неопределено Тогда
		 КоличествоПроживающих 		= ДанныеАбонента["КоличествоПроживающих"];
	ИначеЕсли НЕ ЭтоСоотвествие И ДанныеАбонента.Свойство("КоличествоПроживающих") И НЕ ДанныеАбонента.КоличествоПроживающих = Неопределено Тогда
		КоличествоПроживающих 		= ДанныеАбонента.КоличествоПроживающих;
	КонецЕсли;
	
	Если ЭтоСоотвествие и НЕ ДанныеАбонента["КоличествоПрописанных"] = Неопределено Тогда
		КоличествоПрописанных 		= ДанныеАбонента["КоличествоПрописанных"];		
	ИначеЕсли НЕ ЭтоСоотвествие И ДанныеАбонента.Свойство("КоличествоПрописанных") И НЕ ДанныеАбонента.КоличествоПрописанных = Неопределено Тогда
		КоличествоПрописанных 		= ДанныеАбонента.КоличествоПрописанных;
	КонецЕсли;
	
	Если ЭтоСоотвествие и НЕ ДанныеАбонента["КоличествоСобственников"] = Неопределено Тогда
		КоличествоСобственников 	= ДанныеАбонента["КоличествоСобственников"];
	ИначеЕсли НЕ ЭтоСоотвествие И ДанныеАбонента.Свойство("КоличествоСобственников") И НЕ ДанныеАбонента.КоличествоСобственников = Неопределено Тогда
		КоличествоСобственников 	= ДанныеАбонента.КоличествоСобственников;
	КонецЕсли;
	
	Если НЕ КоличествоЖильцов = 0 Тогда
		Возврат КоличествоЖильцов;
	ИначеЕсли НЕ КоличествоПроживающих = 0 Тогда
		Возврат КоличествоПроживающих;
	ИначеЕсли НЕ КоличествоПрописанных = 0 Тогда
		Возврат КоличествоПрописанных;
	Иначе 
		Возврат КоличествоСобственников;
	КонецЕсли;
		
КонецФункции
